{
  "updates": [
    {
      "version": "2.2.1",
      "whatsNew": ["Oops, fix endpoint typo"],
      "means": ["Working again"]
    },
    {
      "version": "2.2.0",
      "whatsNew": ["Change t0 /random"],
      "means": ["Archillect stopped posting"]
    },
    {
      "version": "2.1.0",
      "whatsNew": [
        "General bug fixes and UI improvements",
        "All the 100% off coupon codes are used 😱"
      ],
      "means": [
        "Better support",
        "Contact me personally if you want free access to the extension, I'll give you a code."
      ]
    },
    {
      "version": "2.0.2",
      "whatsNew": ["Bug fixes"],
      "means": [
        "For it to continue working, you must now insert a license key, you can get it from gumroad (link at top of page, use discount code 'early' for 100% off forever)"
      ]
    },
    {
      "version": "2.0.0",
      "whatsNew": [
        "Archillect tab is moving to a paid model, but I'm mkaing it free for anyone who has it now! Use discount code 'early' to get 100% off."
      ],
      "means": [
        "You need to enter a license key to use the extension, you can get it from going to the gumroad link at the top of this page. Enter your license key in the popup that shows up when you click the extension icon. If you have any questions, please email me at julienbmartel@gmail.com."
      ]
    },
    {
      "version": "1.6.9",
      "whatsNew": ["Storing images as base 64 so they show up faster"],
      "means": ["FASTER 🏎"]
    },
    {
      "version": "1.6.0",
      "whatsNew": [
        "Bug fixes to make it work with new API",
        "added github link",
        "added donation options"
      ],
      "means": [
        "Everything back to normal 🤗",
        "Please donate if you enjoy my free work, thank you the few current supporters 🥰"
      ]
    },
    {
      "version": "1.5.0",
      "whatsNew": ["Bug fixes"],
      "means": ["Works properly lol"]
    },
    {
      "version": "1.4.9",
      "whatsNew": ["Just backend stuff 👨‍💻. Created a better Archillect API"],
      "means": ["TV option coming back eventually"]
    },
    {
      "version": "1.0.0",
      "whatsNew": [
        "Some UI fixes",
        "Now saves base64 URL of image to local storage so it doeant have to load from the img src every time"
      ],
      "means": ["Even faster img load times"]
    },
    {
      "version": "0.9.0",
      "whatsNew": [
        "Created unofficial Archillect API so no more API costs",
        "Moved API (used to be the proxy) off Heroku since they no longer offer free hosting",
        "Removed TV option",
        "Removed settings cog"
      ],
      "means": ["We're back baby😎"]
    },
    {
      "version": "0.1.0",
      "whatsNew": [
        "Archillect TV option📺",
        "More donation options",
        "Share to Twetch option"
      ],
      "means": [
        "For TV option: GIFs fetch every 6 seconds when you're on the 'New Tab' page, and every 1 minute (in the background) if you're not on the page"
      ]
    },
    {
      "version": "0.0.4",
      "whatsNew": [
        "Caching server stays more up to date w/ Archillect",
        "Fixed a bug that would make popup menu flash on startup on certain browsers",
        "Made myself a pipeline to deploy updates more easily from my end"
      ],
      "means": [
        "Less calls from your end, same great speeds",
        "Less work to update for me🙂"
      ]
    },
    {
      "version": "0.0.3",
      "whatsNew": [
        "Timer to fetch new image runs more often",
        "Small UI changes"
      ],
      "means": ["More up-to-date with the most recent image⏲️"]
    },
    {
      "version": "0.0.2",
      "whatsNew": [
        "Images are fetched in a background script on a timer",
        "Images are being saved to & pulled from local storage for use",
        "Created a middleware server for caching, between Archillect API & the extention"
      ],
      "means": [
        "Much faster speeds🔥",
        "Can support many more users before hitting the Archillect API rate limit, thanks to middleware server"
      ]
    }
  ]
}
